<a href="https://colab.research.google.com/github/KimHyungkeun/DE_Starterkit_Programmers/blob/week4_hw/week4_HW.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# Before
def load(lines):
    # BEGIN과 END를 사용해서 SQL 결과를 트랜잭션으로 만들어주는 것이 좋음
    # BEGIN;DELETE FROM (본인의스키마).name_gender;INSERT INTO TABLE VALUES ('KEEYONG', 'MALE');....;END;
    cur = get_Redshift_connection()
    for r in lines:
        if r != '':
            (name, gender) = r.split(",")
            print(name, "-", gender)
            sql = "INSERT INTO hyungkeun_kim95.name_gender VALUES ('{n}', '{g}')".format(n=name, g=gender)
            print(sql)
            cur.execute(sql)

In [ ]:
def load(lines):
    # BEGIN과 END를 사용해서 SQL 결과를 트랜잭션으로 만들어주는 것이 좋음
    cur = get_Redshift_connection()
    del_sql = "DELETE FROM hyungkeun_kim95.name_gender"
    cur.execute(del_sql)
    n = len(lines)
    for i in range(n):
        if lines[i] != '' :
            if i == 0 : # 가장 첫번째는 컬럼헤더이름이므로 생략한다
              continue
            (name, gender) = lines[i].split(",")
            print(name, "-", gender)
            sql = """
            BEGIN;     
            INSERT INTO hyungkeun_kim95.name_gender VALUES ('{n}', '{g}');
            END;""".format(n=name, g=gender)
            print(sql)
            cur.execute(sql)